MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32GG12B530F512IQ100/mcu.h
/* Bit fields for MSC IEN */
#define _MSC_IEN_RESETVALUE                               0x00000000UL                       /**< Default value for MSC_IEN */
#define _MSC_IEN_MASK                                     0x003F017FUL                       /**< Mask for MSC_IEN */
#define MSC_IEN_ERASE                                     (0x1UL << 0)                       /**< ERASE Interrupt Enable */
#define _MSC_IEN_ERASE_SHIFT                              0                                  /**< Shift value for MSC_ERASE */
#define _MSC_IEN_ERASE_MASK                               0x1UL                              /**< Bit mask for MSC_ERASE */
#define _MSC_IEN_ERASE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_ERASE_DEFAULT                             (_MSC_IEN_ERASE_DEFAULT << 0)      /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_WRITE                                     (0x1UL << 1)                       /**< WRITE Interrupt Enable */
#define _MSC_IEN_WRITE_SHIFT                              1                                  /**< Shift value for MSC_WRITE */
#define _MSC_IEN_WRITE_MASK                               0x2UL                              /**< Bit mask for MSC_WRITE */
#define _MSC_IEN_WRITE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_WRITE_DEFAULT                             (_MSC_IEN_WRITE_DEFAULT << 1)      /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_CHOF                                      (0x1UL << 2)                       /**< CHOF Interrupt Enable */
#define _MSC_IEN_CHOF_SHIFT                               2                                  /**< Shift value for MSC_CHOF */
#define _MSC_IEN_CHOF_MASK                                0x4UL                              /**< Bit mask for MSC_CHOF */
#define _MSC_IEN_CHOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_CHOF_DEFAULT                              (_MSC_IEN_CHOF_DEFAULT << 2)       /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_CMOF                                      (0x1UL << 3)                       /**< CMOF Interrupt Enable */
#define _MSC_IEN_CMOF_SHIFT                               3                                  /**< Shift value for MSC_CMOF */
#define _MSC_IEN_CMOF_MASK                                0x8UL                              /**< Bit mask for MSC_CMOF */
#define _MSC_IEN_CMOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_CMOF_DEFAULT                              (_MSC_IEN_CMOF_DEFAULT << 3)       /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_PWRUPF                                    (0x1UL << 4)                       /**< PWRUPF Interrupt Enable */
#define _MSC_IEN_PWRUPF_SHIFT                             4                                  /**< Shift value for MSC_PWRUPF */
#define _MSC_IEN_PWRUPF_MASK                              0x10UL                             /**< Bit mask for MSC_PWRUPF */
#define _MSC_IEN_PWRUPF_DEFAULT                           0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_PWRUPF_DEFAULT                            (_MSC_IEN_PWRUPF_DEFAULT << 4)     /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_ICACHERR                                  (0x1UL << 5)                       /**< ICACHERR Interrupt Enable */
#define _MSC_IEN_ICACHERR_SHIFT                           5                                  /**< Shift value for MSC_ICACHERR */
#define _MSC_IEN_ICACHERR_MASK                            0x20UL                             /**< Bit mask for MSC_ICACHERR */
#define _MSC_IEN_ICACHERR_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_ICACHERR_DEFAULT                          (_MSC_IEN_ICACHERR_DEFAULT << 5)   /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_WDATAOV                                   (0x1UL << 6)                       /**< WDATAOV Interrupt Enable */
#define _MSC_IEN_WDATAOV_SHIFT                            6                                  /**< Shift value for MSC_WDATAOV */
#define _MSC_IEN_WDATAOV_MASK                             0x40UL                             /**< Bit mask for MSC_WDATAOV */
#define _MSC_IEN_WDATAOV_DEFAULT                          0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_WDATAOV_DEFAULT                           (_MSC_IEN_WDATAOV_DEFAULT << 6)    /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_LVEWRITE                                  (0x1UL << 8)                       /**< LVEWRITE Interrupt Enable */
#define _MSC_IEN_LVEWRITE_SHIFT                           8                                  /**< Shift value for MSC_LVEWRITE */
#define _MSC_IEN_LVEWRITE_MASK                            0x100UL                            /**< Bit mask for MSC_LVEWRITE */
#define _MSC_IEN_LVEWRITE_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_LVEWRITE_DEFAULT                          (_MSC_IEN_LVEWRITE_DEFAULT << 8)   /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR1B                                  (0x1UL << 16)                      /**< RAMERR1B Interrupt Enable */
#define _MSC_IEN_RAMERR1B_SHIFT                           16                                 /**< Shift value for MSC_RAMERR1B */
#define _MSC_IEN_RAMERR1B_MASK                            0x10000UL                          /**< Bit mask for MSC_RAMERR1B */
#define _MSC_IEN_RAMERR1B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR1B_DEFAULT                          (_MSC_IEN_RAMERR1B_DEFAULT << 16)  /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR2B                                  (0x1UL << 17)                      /**< RAMERR2B Interrupt Enable */
#define _MSC_IEN_RAMERR2B_SHIFT                           17                                 /**< Shift value for MSC_RAMERR2B */
#define _MSC_IEN_RAMERR2B_MASK                            0x20000UL                          /**< Bit mask for MSC_RAMERR2B */
#define _MSC_IEN_RAMERR2B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR2B_DEFAULT                          (_MSC_IEN_RAMERR2B_DEFAULT << 17)  /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR1B                                 (0x1UL << 18)                      /**< RAM1ERR1B Interrupt Enable */
#define _MSC_IEN_RAM1ERR1B_SHIFT                          18                                 /**< Shift value for MSC_RAM1ERR1B */
#define _MSC_IEN_RAM1ERR1B_MASK                           0x40000UL                          /**< Bit mask for MSC_RAM1ERR1B */
#define _MSC_IEN_RAM1ERR1B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR1B_DEFAULT                         (_MSC_IEN_RAM1ERR1B_DEFAULT << 18) /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR2B                                 (0x1UL << 19)                      /**< RAM1ERR2B Interrupt Enable */
#define _MSC_IEN_RAM1ERR2B_SHIFT                          19                                 /**< Shift value for MSC_RAM1ERR2B */
#define _MSC_IEN_RAM1ERR2B_MASK                           0x80000UL                          /**< Bit mask for MSC_RAM1ERR2B */
#define _MSC_IEN_RAM1ERR2B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR2B_DEFAULT                         (_MSC_IEN_RAM1ERR2B_DEFAULT << 19) /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM2ERR1B                                 (0x1UL << 20)                      /**< RAM2ERR1B Interrupt Enable */
#define _MSC_IEN_RAM2ERR1B_SHIFT                          20                                 /**< Shift value for MSC_RAM2ERR1B */
#define _MSC_IEN_RAM2ERR1B_MASK                           0x100000UL                         /**< Bit mask for MSC_RAM2ERR1B */
#define _MSC_IEN_RAM2ERR1B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM2ERR1B_DEFAULT                         (_MSC_IEN_RAM2ERR1B_DEFAULT << 20) /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM2ERR2B                                 (0x1UL << 21)                      /**< RAM2ERR2B Interrupt Enable */
#define _MSC_IEN_RAM2ERR2B_SHIFT                          21                                 /**< Shift value for MSC_RAM2ERR2B */
#define _MSC_IEN_RAM2ERR2B_MASK                           0x200000UL                         /**< Bit mask for MSC_RAM2ERR2B */
#define _MSC_IEN_RAM2ERR2B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM2ERR2B_DEFAULT                         (_MSC_IEN_RAM2ERR2B_DEFAULT << 21) /**< Shifted mode DEFAULT for MSC_IEN */

/* Bit fields for MSC LOCK */
#define _MSC_LOCK_RESETVALUE                              0x00000000UL                      /**< Default value for MSC_LOCK */
#define _MSC_LOCK_MASK                                    0x0000FFFFUL                      /**< Mask for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_SHIFT                           0                                 /**< Shift value for MSC_LOCKKEY */
#define _MSC_LOCK_LOCKKEY_MASK                            0xFFFFUL                          /**< Bit mask for MSC_LOCKKEY */
#define _MSC_LOCK_LOCKKEY_DEFAULT                         0x00000000UL                      /**< Mode DEFAULT for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_UNLOCKED                        0x00000000UL                      /**< Mode UNLOCKED for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_LOCK                            0x00000000UL                      /**< Mode LOCK for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_LOCKED                          0x00000001UL                      /**< Mode LOCKED for MSC_LOCK */
#define _MSC_LOCK_LOCKKEY_UNLOCK                          0x00001B71UL                      /**< Mode UNLOCK for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_DEFAULT                          (_MSC_LOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_UNLOCKED                         (_MSC_LOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_LOCK                             (_MSC_LOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_LOCKED                           (_MSC_LOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for MSC_LOCK */
#define MSC_LOCK_LOCKKEY_UNLOCK                           (_MSC_LOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for MSC_LOCK */

/* Bit fields for MSC CACHECMD */
#define _MSC_CACHECMD_RESETVALUE                          0x00000000UL                          /**< Default value for MSC_CACHECMD */
#define _MSC_CACHECMD_MASK                                0x00000007UL                          /**< Mask for MSC_CACHECMD */
#define MSC_CACHECMD_INVCACHE                             (0x1UL << 0)                          /**< Invali2026-03-10 Instruction Cache */
#define _MSC_CACHECMD_INVCACHE_SHIFT                      0                                     /**< Shift value for MSC_INVCACHE */
#define _MSC_CACHECMD_INVCACHE_MASK                       0x1UL                                 /**< Bit mask for MSC_INVCACHE */
#define _MSC_CACHECMD_INVCACHE_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MSC_CACHECMD */
#define MSC_CACHECMD_INVCACHE_DEFAULT                     (_MSC_CACHECMD_INVCACHE_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_CACHECMD */
#define MSC_CACHECMD_STARTPC                              (0x1UL << 1)                          /**< Start Performance Counters */
#define _MSC_CACHECMD_STARTPC_SHIFT                       1                                     /**< Shift value for MSC_STARTPC */
#define _MSC_CACHECMD_STARTPC_MASK                        0x2UL                                 /**< Bit mask for MSC_STARTPC */
#define _MSC_CACHECMD_STARTPC_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for MSC_CACHECMD */
#define MSC_CACHECMD_STARTPC_DEFAULT                      (_MSC_CACHECMD_STARTPC_DEFAULT << 1)  /**< Shifted mode DEFAULT for MSC_CACHECMD */
#define MSC_CACHECMD_STOPPC                               (0x1UL << 2)                          /**< Stop Performance Counters */
#define _MSC_CACHECMD_STOPPC_SHIFT                        2                                     /**< Shift value for MSC_STOPPC */
#define _MSC_CACHECMD_STOPPC_MASK                         0x4UL                                 /**< Bit mask for MSC_STOPPC */
#define _MSC_CACHECMD_STOPPC_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for MSC_CACHECMD */
#define MSC_CACHECMD_STOPPC_DEFAULT                       (_MSC_CACHECMD_STOPPC_DEFAULT << 2)   /**< Shifted mode DEFAULT for MSC_CACHECMD */

